In [1]:
import pandas as pd

Download the titanic dataset from kaggle (https://www.kaggle.com/c/titanic/data):

In [2]:
df = pd.read_csv("/tmp/train.csv")
print(df.shape)
df.head()

(891, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df["Survived"].unique()

array([0, 1])

In [4]:
df['Survived'].sum()

342

In [5]:
died = df.Survived==0
died.sum()

549

In [6]:
cond = df.Sex == 'male'
cond.mean()

0.6475869809203143

In [7]:
df.Pclass.nunique()

3

In [8]:
df.Pclass.unique()

array([3, 1, 2])

In [9]:
df.Fare.nunique()

248

In [10]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [11]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## Subsetting
Similar to SQL statement `select * where (condition) ...`

In [29]:
df[df.Pclass==1].tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_name,log_fare
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S,Beckwith,3.980694
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S,Carlsson,1.791759
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C,Potter,4.432700
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Graham,3.433987
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Behr,3.433987

In [13]:
df[(df.Pclass==1) & (df.Sex=='male')].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C

In [33]:
cond1 = df.Pclass > 1
cond2 = df.Sex != 'male'

df[cond1 & cond2].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_name,log_fare
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,2.188856
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,Johnson,2.495954
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,Nasser,3.436268
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S,Sandstrom,2.873565
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S,Vestrom,2.180892

## loc and iloc

In [38]:
df = df.sample(frac=1)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_name,log_fare
220,221,1,3,"Sunderland, Mr. Victor Francis",male,16.0,0,0,SOTON/OQ 392089,8.0500,NaN,S,Sunderland,2.202765
458,459,1,2,"Toomey, Miss. Ellen",female,50.0,0,0,F.C.C. 13531,10.5000,NaN,S,Toomey,2.442347
448,449,1,3,"Baclini, Miss. Marie Catherine",female,5.0,2,1,2666,19.2583,NaN,C,Baclini,3.008565
355,356,0,3,"Vanden Steen, Mr. Leo Peter",male,28.0,0,0,345783,9.5000,NaN,S,Vanden Steen,2.351375
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S,Johnson,2.495954

In [46]:
df.loc[4]

PassengerId                           5
Survived                              0
Pclass                                3
Name           Allen, Mr. William Henry
Sex                                male
Age                                  35
SibSp                                 0
Parch                                 0
Ticket                           373450
Fare                               8.05
Cabin                               NaN
Embarked                              S
Last_name                         Allen
log_fare                        2.20276
Name: 4, dtype: object

In [48]:
df.loc[[4, 5], "Sex"]

4    male
5    male
Name: Sex, dtype: object

In [50]:
df.iloc[[4, 5], 4]

869    male
95     male
Name: Sex, dtype: object

In [51]:
df.loc[[869, 95], "Sex"]

869    male
95     male
Name: Sex, dtype: object

In [45]:
df.iloc[4]

PassengerId                                870
Survived                                     1
Pclass                                       3
Name           Johnson, Master. Harold Theodor
Sex                                       male
Age                                          4
SibSp                                        1
Parch                                        1
Ticket                                  347742
Fare                                   11.1333
Cabin                                      NaN
Embarked                                     S
Last_name                              Johnson
log_fare                               2.49595
Name: 869, dtype: object

In [15]:
female_df = df[df.Sex=='female']
female_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [55]:
female_df.iloc[4]

PassengerId                                     10
Survived                                         1
Pclass                                           2
Name           Nasser, Mrs. Nicholas (Adele Achem)
Sex                                         female
Age                                             14
SibSp                                            1
Parch                                            0
Ticket                                      237736
Fare                                       30.0708
Cabin                                          NaN
Embarked                                         C
Name: 9, dtype: object

In [16]:
female_df.iloc[4]

PassengerId                                     10
Survived                                         1
Pclass                                           2
Name           Nasser, Mrs. Nicholas (Adele Achem)
Sex                                         female
Age                                             14
SibSp                                            1
Parch                                            0
Ticket                                      237736
Fare                                       30.0708
Cabin                                          NaN
Embarked                                         C
Name: 9, dtype: object

In [17]:
female_df.loc[:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [56]:
female_df.iloc[:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S

In [58]:
female_df.iloc[:4][['Survived', 'Name', 'Pclass']]

   Survived                                               Name  Pclass
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1
2         1                             Heikkinen, Miss. Laina       3
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1
8         1  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)       3

In [19]:
female_df.loc[female_df['Pclass']==3, ['Survived', 'Name', 'Pclass']]

     Survived                                               Name  Pclass
2           1                             Heikkinen, Miss. Laina       3
8           1  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)       3
10          1                    Sandstrom, Miss. Marguerite Rut       3
14          0               Vestrom, Miss. Hulda Amanda Adolfina       3
18          0  Vander Planke, Mrs. Julius (Emelia Maria Vande...       3
..        ...                                                ...     ...
863         0                  Sage, Miss. Dorothy Edith "Dolly"       3
875         1                   Najib, Miss. Adele Kiamie "Jane"       3
882         0                       Dahlberg, Miss. Gerda Ulrika       3
885         0               Rice, Mrs. William (Margaret Norton)       3
888         0           Johnston, Miss. Catherine Helen "Carrie"       3

[144 rows x 3 columns]

## Map and Apply

In [60]:
df.sort_index(inplace=True)

In [61]:
df.Name.values[-10:][0]

'Markun, Mr. Johann'

In [65]:
"Markun, Mr. Johann".split(",")[0]

'Markun'

In [ ]:
def get_first_name(x):
    return x.split(',')[0]

In [66]:
df['Last_name'] = df["Name"].map(lambda x: x.split(',')[0])
df.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_name,log_fare
653,654,1,3,"O'Leary, Miss. Hanora ""Norah""",female,NaN,0,0,330919,7.8292,NaN,Q,O'Leary,2.178064
765,766,1,1,"Hogeboom, Mrs. John C (Anna Andrews)",female,51.0,1,0,13502,77.9583,D11,S,Hogeboom,4.368920
307,308,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.9000,C65,C,Penasco y Castellana,4.699571
70,71,0,2,"Jenkin, Mr. Stephen Curnow",male,32.0,0,0,C.A. 33111,10.5000,NaN,S,Jenkin,2.442347
590,591,0,3,"Rintamaki, Mr. Matti",male,35.0,0,0,STON/O 2. 3101273,7.1250,NaN,S,Rintamaki,2.094946
445,446,1,1,"Dodge, Master. Washington",male,4.0,0,2,33638,81.8583,A34,S,Dodge,4.417132
450,451,0,2,"West, Mr. Edwy Arthur",male,36.0,1,2,C.A. 34651,27.7500,NaN,S,West,3.358638
189,190,0,3,"Turcin, Mr. Stjepan",male,36.0,0,0,349247,7.8958,NaN,S,Turcin,2.185579
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S,Johnson,2.495954
396,397,0,3,"Olsson, Miss. Elina",female,31.0,0,0,350407,7.8542,NaN,S,Olsson,2.180892

In [23]:
df.apply(lambda x: x["Name"] + " " + str(x["Age"]), axis=1)

0                           Braund, Mr. Owen Harris 22.0
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                            Heikkinen, Miss. Laina 26.0
3      Futrelle, Mrs. Jacques Heath (Lily May Peel) 35.0
4                          Allen, Mr. William Henry 35.0
                             ...
886                           Montvila, Rev. Juozas 27.0
887                    Graham, Miss. Margaret Edith 19.0
888         Johnston, Miss. Catherine Helen "Carrie" nan
889                           Behr, Mr. Karl Howell 26.0
890                             Dooley, Mr. Patrick 32.0
Length: 891, dtype: object

In [24]:
df.Fare.min()

0.0

In [67]:
import numpy as np

df['log_fare'] = df.Fare.apply(lambda x: np.log(x + 1))
df.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_name,log_fare
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.00,0,0,112053,30.0000,B42,S,Graham,3.433987
175,176,0,3,"Klasen, Mr. Klas Albin",male,18.00,1,1,350404,7.8542,NaN,S,Klasen,2.180892
722,723,0,2,"Gillespie, Mr. William Henry",male,34.00,0,0,12233,13.0000,NaN,S,Gillespie,2.639057
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,Allison,5.027492
890,891,0,3,"Dooley, Mr. Patrick",male,32.00,0,0,370376,7.7500,NaN,Q,Dooley,2.169054
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.00,1,1,C.A. 2673,20.2500,NaN,S,Abbott,3.056357
118,119,0,1,"Baxter, Mr. Quigg Edmond",male,24.00,0,1,PC 17558,247.5208,B58 B60,C,Baxter,5.515527
601,602,0,3,"Slabenoff, Mr. Petco",male,NaN,0,0,349214,7.8958,NaN,S,Slabenoff,2.185579
220,221,1,3,"Sunderland, Mr. Victor Francis",male,16.00,0,0,SOTON/OQ 392089,8.0500,NaN,S,Sunderland,2.202765
142,143,1,3,"Hakkarainen, Mrs. Pekka Pietari (Elin Matilda ...",female,24.00,1,0,STON/O2. 3101279,15.8500,NaN,S,Hakkarainen,2.824351

## Groupby

In [26]:
df.groupby("Pclass")["log_fare"].mean()

Pclass
1    4.097748
2    2.886742
3    2.491012
Name: log_fare, dtype: float64

In [70]:
df["Age"].isnull().sum()

177

In [73]:
df.groupby("Pclass")["Age"].apply(lambda x: x.isnull().sum())

Pclass
1     30
2     11
3    136
Name: Age, dtype: int64

In [79]:
df.groupby("Pclass").agg({"Age": [sum, min, max, np.mean]})

            Age
            sum   min   max       mean
Pclass
1       7111.42  0.92  80.0  38.233441
2       5168.83  0.67  70.0  29.877630
3       8924.92  0.42  74.0  25.140620

In [80]:
for name, grp in df.groupby("Pclass"):
#     import pdb; pdb.set_trace()
    breakpoint()

> <ipython-input-80-a3d9b47d5bbb>(1)<module>()
-> for name, grp in df.groupby("Pclass"):
(Pdb) name
1
(Pdb) grp
     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
6              7         0       1
11            12         1       1
23            24         1       1
..           ...       ...     ...
871          872         1       1
872          873         0       1
879          880         1       1
887          888         1       1
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                              McCarthy, Mr. Timothy J    male  54.0      0
11                            Bonnell, Miss. Elizabeth  female  58.0      0
23                        Sloper, Mr. William Thompson    male  28.0      0
..                                                 ...     ...   ...    ...
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
872                           Carlsson, Mr. Frans Olof    male  33.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch    Ticket     Fare        Cabin Embarked Last_name  log_fare
1        0  PC 17599  71.2833          C85        C   Cumings  4.280593
3        0    113803  53.1000         C123        S  Futrelle  3.990834
6        0     17463  51.8625          E46        S  McCarthy  3.967694
11       0    113783  26.5500         C103        S   Bonnell  3.316003
23       0    113788  35.5000           A6        S    Sloper  3.597312
..     ...       ...      ...          ...      ...       ...       ...
871      1     11751  52.5542          D35        S  Beckwith  3.980694
872      0       695   5.0000  B51 B53 B55        S  Carlsson  1.791759
879      1     11767  83.1583          C50        C    Potter  4.432700
887      0    112053  30.0000          B42        S    Graham  3.433987
889      0    111369  30.0000         C148        C      Behr  3.433987

[216 rows x 14 columns]
(Pdb) exit

BdbQuit:

## Summary
- Useful functions: `df.head(), df.describe()`
- `apply` is used to apply functions to columns per row.
- Use conditions to subset the dataframe.
- Careful when using `loc` and `iloc`.